postman/collections/StockQuoteService_900611-2f549410-5078-40a4-b750-0005dc63dd90.json

{
	"info": {
		"_postman_id": "2f549410-5078-40a4-b750-0005dc63dd90",
		"name": "StockQuoteService",
		"description": "Add your service description here\n",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_uid": "900611-2f549410-5078-40a4-b750-0005dc63dd90"
	},
	"item": [
		{
			"name": "GetLastTradePrice",
			"id": "8db87284-027a-4da1-8157-613c4a43cea6",
			"protocolProfileBehavior": {
				"disableBodyPruning": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8"
					},
					{
						"key": "SOAPAction",
						"value": "http://example.com/GetLastTradePrice"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "{{StockQuotePortBaseUrl}}/stockquote",
					"host": [
						"{{StockQuotePortBaseUrl}}"
					],
					"path": [
						"stockquote"
					]
				}
			},
			"response": [
				{
					"id": "a9802b1d-3b1d-4649-b881-dd60686b0081",
					"name": "GetLastTradePrice response",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							},
							{
								"key": "SOAPAction",
								"value": "http://example.com/GetLastTradePrice"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{StockQuotePortBaseUrl}}/stockquote",
							"host": [
								"{{StockQuotePortBaseUrl}}"
							],
							"path": [
								"stockquote"
							]
						}
					},
					"status": "OK",
					"code": 200,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePrice xmlns=\"http://example.com/stockquote.xsd\">\n      <price>6</price>\n    </TradePrice>\n  </soap:Body>\n</soap:Envelope>\n"
				}
			]
		}
	],
	"variable": [
		{
			"id": "a1f37298-7d66-4e00-9e1b-a35590f78464",
			"key": "StockQuotePortBaseUrl",
			"value": "http://example.com",
			"type": "any"
		}
	]
}