postman/collections/local_900611-ea5ec827-8931-4805-98a8-96b8cbe78967.json

{
	"info": {
		"_postman_id": "ea5ec827-8931-4805-98a8-96b8cbe78967",
		"name": "local",
		"description": "Add your service description here\n",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_uid": "900611-ea5ec827-8931-4805-98a8-96b8cbe78967"
	},
	"item": [
		{
			"name": "GetLastTradePrice",
			"id": "cbf4fa23-4260-4d97-9431-dea559b09d71",
			"protocolProfileBehavior": {
				"disableBodyPruning": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8"
					},
					{
						"key": "SOAPAction",
						"value": "http://example.com/GetLastTradePrice"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "{{StockQuotePortBaseUrl}}/stockquote",
					"host": [
						"{{StockQuotePortBaseUrl}}"
					],
					"path": [
						"stockquote"
					]
				}
			},
			"response": [
				{
					"id": "95bcc71a-01ae-4f49-a145-13f45e0c34a1",
					"name": "GetLastTradePrice response",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							},
							{
								"key": "SOAPAction",
								"value": "http://example.com/GetLastTradePrice"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{StockQuotePortBaseUrl}}/stockquote",
							"host": [
								"{{StockQuotePortBaseUrl}}"
							],
							"path": [
								"stockquote"
							]
						}
					},
					"status": "OK",
					"code": 200,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePrice xmlns=\"http://example.com/stockquote.xsd\">\n      <price>19</price>\n    </TradePrice>\n  </soap:Body>\n</soap:Envelope>\n"
				}
			]
		}
	],
	"variable": [
		{
			"id": "2deea2ae-f624-4955-b43d-abf407464875",
			"key": "StockQuotePortBaseUrl",
			"value": "http://example.com",
			"type": "any"
		}
	]
}