postman/collections/2_900611-8880cb8a-5167-409a-b575-f045a7783f10.json

{
	"info": {
		"_postman_id": "8880cb8a-5167-409a-b575-f045a7783f10",
		"name": "2",
		"description": "Add your service description here\n",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_uid": "900611-8880cb8a-5167-409a-b575-f045a7783f10"
	},
	"item": [
		{
			"name": "GetLastTradePrice",
			"id": "e4aa8213-38f0-4b62-a9f5-4e6bb22a6df8",
			"protocolProfileBehavior": {
				"disableBodyPruning": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8"
					},
					{
						"key": "SOAPAction",
						"value": "http://example.com/GetLastTradePrice"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "{{StockQuotePortBaseUrl}}/stockquote",
					"host": [
						"{{StockQuotePortBaseUrl}}"
					],
					"path": [
						"stockquote"
					]
				}
			},
			"response": [
				{
					"id": "9674d31d-f076-4229-a99b-23a06567df9a",
					"name": "GetLastTradePrice response",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							},
							{
								"key": "SOAPAction",
								"value": "http://example.com/GetLastTradePrice"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{StockQuotePortBaseUrl}}/stockquote",
							"host": [
								"{{StockQuotePortBaseUrl}}"
							],
							"path": [
								"stockquote"
							]
						}
					},
					"status": "OK",
					"code": 200,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePrice xmlns=\"http://example.com/stockquote.xsd\">\n      <price>82</price>\n    </TradePrice>\n  </soap:Body>\n</soap:Envelope>\n"
				}
			]
		}
	],
	"variable": [
		{
			"id": "5195bb1a-8d17-4b18-b1d5-516b06de98d9",
			"key": "StockQuotePortBaseUrl",
			"value": "http://example.com",
			"type": "any"
		}
	]
}